In [1]:
a=[1,2,3,4]
a

[1, 2, 3, 4]

In [2]:
import numpy as np
import pandas as pd

In [4]:
a_array=np.array([a])
a_array

array([[1, 2, 3, 4]])

In [5]:
b=[12,23,34]
b

[12, 23, 34]

In [6]:
b_panda=pd.Series([b])
b_panda

0    [12, 23, 34]
dtype: object

In [9]:
type(b_panda)

pandas.core.series.Series

In [12]:
seri=pd.Series([50,60,70,80,90],index=[1,2,3,4,5])

In [16]:
notlar={"ali":12,"veli":20}
pd.Series(notlar)

ali     12
veli    20
dtype: int64

In [21]:
seri4=pd.Series([121,200,150,99],index=["Kitap1","Kitap2","Kitap3","Kİtap4"])
seri4

Kitap1    121
Kitap2    200
Kitap3    150
Kİtap4     99
dtype: int64

In [23]:
seri4.keys

<bound method Series.keys of Kitap1    121
Kitap2    200
Kitap3    150
Kİtap4     99
dtype: int64>

In [28]:
seri4["Kitap1":"Kİtap4"]

Kitap1    121
Kitap2    200
Kitap3    150
Kİtap4     99
dtype: int64

In [31]:
seri4["Kitap1"]="biti"
seri4

Kitap1    biti
Kitap2     200
Kitap3     150
Kİtap4      99
dtype: object

In [39]:
l=([1,3,2,7,8,12])

In [42]:
pd.DataFrame(l,columns=["degisken"])

   degisken
0         1
1         3
2         2
3         7
4         8
5        12

In [ ]:
 m=np.arange(1,10).reshape((3,3))
 pd.DataFrame(m,columns=["birinci","ikinci","üçüncü"])

In [70]:
array=np.random.randint(1,10,size=(3,3))
d_f=pd.DataFrame(array,columns=["deg1","deg2","deg3"])
d_f

   deg1  deg2  deg3
0     6     9     6
1     6     9     5
2     4     2     3

In [73]:
d_f.iloc[0:2]

   deg1  deg2  deg3
0     6     9     6
1     6     9     5

In [75]:
d_f.loc[0:2]

   deg1  deg2  deg3
0     6     9     6
1     6     9     5
2     4     2     3

In [76]:
d_f[d_f.deg1>5]

   deg1  deg2  deg3
0     6     9     6
1     6     9     5

In [79]:
d_f2=d_f+100
d_f2

   deg1  deg2  deg3
0   106   109   106
1   106   109   105
2   104   102   103

In [80]:
pd.concat([d_f,d_f2])

   deg1  deg2  deg3
0     6     9     6
1     6     9     5
2     4     2     3
0   106   109   106
1   106   109   105
2   104   102   103

In [81]:
pd.concat([d_f,d_f2],ignore_index=True)

   deg1  deg2  deg3
0     6     9     6
1     6     9     5
2     4     2     3
3   106   109   106
4   106   109   105
5   104   102   103

In [82]:
df3=pd.DataFrame({'calisanlar':["Ali","Veli","Aysr","Fatma"],
                 "grup":["Muhasebe","Muhendislik","Muhendislik","İK"]})
df3

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Aysr  Muhendislik
3      Fatma           İK

In [83]:
df4=pd.DataFrame({'calisanlar':["Ali","Veli","Aysr","Fatma"],
                 "ilk_giris":[2010,2009,2014,2019]})
df4

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Aysr       2014
3      Fatma       2019

In [84]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Aysr  Muhendislik       2014
3      Fatma           İK       2019

In [86]:
df5=pd.merge(df3,df4)
df5

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Aysr  Muhendislik       2014
3      Fatma           İK       2019

In [87]:
df6=pd.DataFrame({"grup":["Muhasebe","Muhendislik","İK"],
                 "mudur":["Caner","Mustafa","Berkcan"]})
df6

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [88]:
pd.merge(df5,df6)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Aysr  Muhendislik       2014  Mustafa
3      Fatma           İK       2019  Berkcan